app/controllers/posts_controller.rb

  def index
    #list of all posts
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    #action of create new post
    #render plain: params[:post].inspect
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "blog post one"], ["body", "this is body of blog post one"], ["created_at", "2017-09-19 01:41:06.692506"], ["updated_at", "2017-09-19 01:41:06.692506"]]

  def edit
    #landing page with form to edit post
     @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    #action of update post
    @post = Post.find(params[:id])

    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "blog post 1"], ["updated_at", "2017-09-19 02:26:18.343935"], ["id", 1]]

  def show
    #show individual post
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    #delete post
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]